content-org/all-posts.org
#+hugo_base_dir: ../

* Reasons being a parent is awesome :parenting:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-02-reasons-being-a-parent-is-awesome
:EXPORT_DATE: 2024-10-02
:END:
I want to share some of the reasons being a parent has been (somewhat
unexpectedly) so good for me personally. I think these reasons will apply to
almost every parent.

Before I start, I want to make it clear my goal is /not/ to convince everyone to
have kids, but rather to show that parenthood is awesome in a couple of ways
that I don't think get talked about enough.

** Being /your/ child's parent has limited (or no) competition
Competition to be your child's best parent is extremely limited. Unlike your
professional interests (and likely your hobbies), the odds are pretty good that
the pool of people trying to parent /your child specifically/ is small. Sometimes,
it might be a pool of one. I certainly feel that I'm only competing against
myself---that my wife and I occupy different, non-competitive niches in our
daughter's life. Within my niche, I am number one; undefeated! It doesn't matter
to me that there isn't really anyone I'm competing against---it still gives me
satisfaction to know that I am the best at what I do.

Furthermore, whatever you do for your child is going to be a large fraction of
their life experience. It doesn't matter very much if the things you do for them
are imperfect---what matters more is that you try. Just trying can get you to
the top of the leaderboard---but you have to try.

** Being a parent is orthogonal to other interests
How good of a parent you are can be completely uncorrelated with your
professional success, your financial situation, or your hobbies. This
decorrelation between parenting and the rest of your life makes it easier to
still feel like a success, even if the only thing you're succeeding in is being
a good parent to your child.
** Being a parent is a great mix of instant and delayed gratification
There are two kinds of work---work that has instantaneous rewards, and work that
has delayed rewards. In my experience, optimal productivity and happiness in
one's work requires a mix of both kinds of work.

Working without any short-term feedback on how you're doing makes it difficult
to improve. Also, a lack of short-term rewards in your work will make each day
exhausting, because at the end of each day you can be left thinking "What did I
do all that work today for?"

On the other hand, work that only has short-term rewards will never build up to
a lifetime of achievement that you can look back on with satisfaction. You might
be happy on each individual day, but the overall narrative arc is missing.

Parenting, in my opinion, has the perfect mix of short-term and long-term
rewards. In the short-term, it is generally rewarding to spend any amount of
time with your kids doing something they enjoy. In the long-term, the things you
work to teach them (both knowledge and values) can gradually shape your child
into a fully-fledged human that you are happy to associate with.
